In [5]:
import pandas as pd
df = pd.read_csv('data/scores.csv')

# 데이터 미리보기
## 가장 앞의 n행 보기
* 데이터프레임.head(n)
* 시리즈.head(n)
* n을 생략하면 5개의 행을 출력한다.

In [7]:
df.head()

   name  kor  eng  math
0     1    5    5    10
1     2    0    0    10
2     3   10   10    10
3     4    6    6    10
4     5   10   10    10

In [8]:
df.head(3)

   name  kor  eng  math
0     1    5    5    10
1     2    0    0    10
2     3   10   10    10

## 가장 뒤의 n행 보기
* 데이터프레임.tail()

In [12]:
df.tail()

           name  kor  eng  math
1048570  120800   10   10     0
1048571  120801   10   10     0
1048572  120802    1    1     0
1048573  120803   10   10     0
1048574  120804    0    0     0

## 랜덤 보기
### 랜덤 n개 데이터 보기
* 데이터프레임.sample(n)
* n을 생략하면 1개의 샘플을 추출

In [13]:
df.sample()

         name  kor  eng  math
416250  55975    1    1    10

### 랜덤 샘플 비율로 보기
*.데이터프레임.sample(frac=0.2)

In [16]:
df.sample(frac=0.2)

         name  kor  eng  math
313463  28672   10   10    10
518276  54923   10   10    10
701291  51297    9    9     9
6403     1399    9    9    10
996430  83362    9    9     0
...       ...  ...  ...   ...
830640  72069   10   10     8
696172  56325    0    0     9
368743   4124   10   10    10
450115  61077   10   10    10
580317  37508   10   10     9

[209715 rows x 4 columns]

## 높은순/낮은순 보기
### 높은순 보기

In [20]:
df.nlargest(5,'eng')

    name  kor  eng  math
2      3   10   10    10
4      5   10   10    10
9     10   10   10    10
11    11   10   10    10
12    12   10   10    10

###  높은순 보기

In [23]:
df.nsmallest(5,'eng')

    name  kor  eng  math
1      2    0    0    10
5      6    0    0    10
16    16    0    0    10
25    16    0    0    10
43    16    0    0    10

# 데이터 요약보기
## (행,열)의 크기 보기
* 데이터프레임.shape

In [24]:
df.shape

(1048575, 4)

## 데이터의 갯수 보기
* len(데이터프레임)
* 행을 기준으로 가져옴

In [25]:
len(df)

1048575

## 컬럼명 보기
* 데이터프레임.columns

In [27]:
df.columns

Index(['name', 'kor', 'eng', 'math'], dtype='object')

## 인덱스 보기
* 데이터프레임.index

In [29]:
df.index

RangeIndex(start=0, stop=1048575, step=1)

## 데이터 자료형 보기
* 0데이터프레임.dtypes
* 판다스에서는 문자열에서 데이터타입이 object이다.

In [30]:
df.dtypes

name    int64
kor     int64
eng     int64
math    int64
dtype: object

## 데이터프레임 정보 보기
* 데이터프레임.info()
* 총 샘플 갯수, 컬럼 수, 컬럼 별 정보 등을 확인할 수 있다.

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 4 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   name    1048575 non-null  int64
 1   kor     1048575 non-null  int64
 2   eng     1048575 non-null  int64
 3   math    1048575 non-null  int64
dtypes: int64(4)
memory usage: 32.0 MB

## 컬럼의 유니크한 테이터뽑기
* 컬럼.unique()

In [35]:
df['kor'].unique()

array([ 5,  0, 10,  6,  1,  2,  9,  3,  4,  8,  7], dtype=int64)

## 컬럼의 유니크한 값의 갯수 보기
* 컬럼.value_counts()

In [36]:
df['kor'].value_counts()

kor
10    558618
9     215500
0      94703
8      56845
1      35826
7      28699
6      19379
2      15925
5      10809
4       6209
3       6062
Name: count, dtype: int64

## 요약통계 보기

In [38]:
df.describe()

               name           kor           eng          math
count  1.048575e+06  1.048575e+06  1.048575e+06  1.048575e+06
mean   4.618060e+04  8.070334e+00  8.070334e+00  8.070334e+00
std    3.345914e+04  3.281157e+00  3.281157e+00  3.281157e+00
min    1.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00
25%    1.694500e+04  8.000000e+00  8.000000e+00  8.000000e+00
50%    4.059500e+04  1.000000e+01  1.000000e+01  1.000000e+01
75%    7.181800e+04  1.000000e+01  1.000000e+01  1.000000e+01
max    1.218570e+05  1.000000e+01  1.000000e+01  1.000000e+01

In [39]:
df['kor'].count()

1048575

In [40]:
df['kor'].mean()

8.07033354791026